vernonet/stm32F4_prj/SPI_Prog/Src/chip_drv.c
/*
 * Copyright (c) 2017-2018 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * -----------------------------------------------------------------------
 *
 * $Date:        19. April 2018
 * $Revision:    V1.1
 *
 * Driver:       Driver_Flash# (default: Driver_Flash0)
 * Project:      Flash Device Driver for spi flash
 * -----------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                   Value
 *   ---------------------                   -----
 *   Connect to hardware via Driver_Flash# = n (default: 0)
 * -------------------------------------------------------------------- */

/* Note:
    Use the following definitions to customize this driver:

    #define DRIVER_FLASH_NUM   #
    Replace symbol # with any integer to customize the number of exported
    driver (i.e. Driver_Flash#) Default setting is 0.
    
    #define DRIVER_SPI_NUM     #
    Replace symbol # with any integer to customize the number of SPI driver
    (i.e. Driver_SPI#) used to communicate with Flash device.
    Default setting is 0.
    
    #define DRIVER_SPI_BUS_SPEED #
    Replace symbol # with any integer to customize the SPI bus frequency.
    Default setting is 36000000 (36MHz).
*/

//#include "Driver_SPI.h"
#include "chip_drv.h"
#include "spi.h"
#include "string.h"
#include "stm32f4xx_hal.h"
#include "stm32f4_discovery.h"
#include "usbd_conf.h"


#include "flashchips.h"

#define ARM_FLASH_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,1) /* driver version */


#ifndef DRIVER_FLASH_NUM
#define DRIVER_FLASH_NUM        0         /* Default driver number */
#endif

#ifndef DRIVER_SPI_NUM
#define DRIVER_SPI_NUM          0         /* Default SPI driver number */
#endif

#ifndef DRIVER_SPI_BUS_SPEED
#define DRIVER_SPI_BUS_SPEED    24000000  /* Default SPI bus speed */
#endif

/* SPI Bus Speed */
#define SPI_BUS_SPEED   ((uint32_t)DRIVER_SPI_BUS_SPEED)

//uint16_t fl_sec_cnt = FLASH_SECTOR_COUNT;

/* Flash Information */
 ARM_FLASH_INFO FlashInfo = {
  NULL,
  FLASH_SECTOR_COUNT,
  FLASH_SECTOR_SIZE,
  FLASH_PAGE_SIZE,
  FLASH_PROGRAM_UNIT,
  FLASH_ERASED_VALUE,
#if (ARM_FLASH_API_VERSION > 0x201U)
  { 0U, 0U, 0U }
#endif
};

/* Flash Status */
static ARM_FLASH_STATUS FlashStatus;
static uint8_t Flags;
    


/* Driver Version */
static const ARM_DRIVER_VERSION DriverVersion = {
  ARM_FLASH_API_VERSION,
  ARM_FLASH_DRV_VERSION
};

/* Driver Capabilities */
static const ARM_FLASH_CAPABILITIES DriverCapabilities = {
  0U,   /* event_ready */
  0U,   /* data_width = 0:8-bit, 1:16-bit, 2:32-bit */
  1U,   /* erase_chip */
#if (ARM_FLASH_API_VERSION > 0x200U)
  0U    /* reserved */
#endif
};

//extern const struct flashchip flashchips[];
const struct flashchip * flschip = NULL; //&flashchips[0];
JEDEC_ID jdc_id_ = {0};
bool first = true;



//attempt to read chip id by different methods
const struct flashchip * ReadId (void) {   
	
	const struct flashchip * flschip_ = NULL; 
	volatile uint32_t i=0x03; 

				while(i-->0) {
					ReadJedecId (CMD_READ_RDID, &jdc_id_) ; 
					delay_mic();	
			  }
				if (jdc_id_.man_id == 0xFF && (jdc_id_.dev_id == 0xFFFF | jdc_id_.dev_id == 0xFF)) {
				i = 1;
				while(i-->0) {
					ReadIdSST (CMD_READ_RDID_SST, &jdc_id_);
					delay_mic();
					}		  
			 }
				if (jdc_id_.man_id == 0xFF && (jdc_id_.dev_id == 0xFFFF | jdc_id_.dev_id == 0xFF | jdc_id_.dev_id == 0x00)) {
				i = 1;
				while(i-->0) {
					ReadIdSST (CMD_READ_RDID_PMC, &jdc_id_);
					delay_mic();
					}		  
			 }
				if (jdc_id_.man_id == 0xFF && (jdc_id_.dev_id == 0xFFFF | jdc_id_.dev_id == 0xFF | jdc_id_.dev_id == 0x00)) {
				i = 1;
				while(i-->0) {
					ReadJedecId (CMD_READ_RDID_ATMEL, &jdc_id_);
					delay_mic();
					}		  
			 }
				 if (!(jdc_id_.man_id == GENERIC_MANUF_ID && (jdc_id_.dev_id == GENERIC_DEVICE_ID ))){
				 flschip_ = flash_id_to_entry(jdc_id_.man_id, jdc_id_.dev_id);
				 }
				 if (flschip_ == NULL) {
					 SPI_UsrLog ("\n Flash not supported\n\n");
				 }
				    else {
							if (first) {
							//SPI_UsrLog ("\n Flash supported");
							SPI_UsrLog ("\n Vendor - %s\n Chip   - %s\n Size   - %d Kbytes\n\n\n",\
							flschip_->vendor, flschip_->name, flschip_->total_size);
							//FlashInfo.sector_count = flschip_->block_erasers->eraseblocks[0].count;
							first = false;
							}
						}
	
	
	return flschip_;
}

/* Read SFDP register */
//uint32_t* _size - size of flash in bytes
 int32_t ReadSfdpReg (uint8_t cmd, uint32_t* _size) {  
  int32_t status; /* driver execution status */
  uint8_t buf_rec[20];  //20
	uint8_t buf_tra[20] = {0};

  /* Select Slave */
  status = ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_ACTIVE);

  if (status == ARM_DRIVER_OK) {
    /* Set command */
    buf_tra[0] = cmd;

    /* Send command and receive register value */
    status = ptrSPI->Transfer (&buf_tra[0], &buf_rec[0], 20U); //20

    if (status == ARM_DRIVER_OK) {
      /* Wait till transfer done */
      while (ptrSPI->GetDataCount() != 20U) {__asm("nop");};
    }
  }
  /* Deselect Slave */
  ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_INACTIVE);
	
	  // Verify SFDP signature for sanity
    // Also check that major/minor version is acceptable
    if (!(memcmp(&buf_rec[5], "SFDP", 4) == 0 && buf_rec[10] == 1)) {
        return ARM_DRIVER_ERROR_UNSUPPORTED;
		}
		// The SFDP spec indicates the standard table is always at offset 0
    // in the parameter headers, we check just to be safe
    if (!((buf_rec[13] == 0xEF || buf_rec[13] == 0x00)&& buf_rec[15] == 1)) {
        return ARM_DRIVER_ERROR_UNSUPPORTED;
    }

    // Parameter table pointer, spi commands are BE, SFDP is LE,
    // also sfdp command expects extra read wait byte
		buf_tra[0] = cmd;
		buf_tra[1] = buf_rec[19];
		buf_tra[2] = buf_rec[18];
		buf_tra[3] = buf_rec[17] ;
		/* Send command and receive register value */
		/* Select Slave */
    status = ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_ACTIVE);
    status = ptrSPI->Transfer (&buf_tra[0], &buf_rec[0], 13U);
		if (status == ARM_DRIVER_OK) {
      /* Wait till transfer done */
      while (ptrSPI->GetDataCount() != 13U) {__asm("nop");};
    }
		/* Deselect Slave */
    ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_INACTIVE);
		// Check erase size, currently only supports 4kbytes
    // TODO support erase size != 4kbytes?
    // TODO support other erase opcodes from the sector descriptions
    if ((buf_rec[5] & 0x3) != 0x1 || buf_rec[6] != CMD_SECTOR_ERASE) {
        return ARM_DRIVER_ERROR_UNSUPPORTED;
    }

    // Check address size, currently only supports 3byte addresses
    // TODO support address > 3bytes?
		//00: 3-Byte only addressing
    //01: 3- or 4-Byte addressing (e.g. defaults to 3-Byte mode; enters 4-Byte mode on command)
    //10: 4-Byte only addressing
    //11: Reserved
		//
    // TODO check for devices larger than 2Gbits?
		//For densities 2 gigabits or less, bit-31 is set to 0b. 
    if (((buf_rec[7] >> 1) & 0x3) != 0 || (buf_rec[12] & 0x80) != 0) {
        return ARM_DRIVER_ERROR_UNSUPPORTED;
    }

    // Get device density, stored as size in bits - 1
		//3-Byte only addressing,   
    uint32_t density = ( 
        (buf_rec[12] << 24) |		
        (buf_rec[11] << 16) |   
        (buf_rec[10] << 8 ) |
        (buf_rec[9]  << 0 ));
    *_size = (density/8) + 1;
  
  return (status);
}
 
