vernonet/stm32F4_prj/SPI_Prog/Src/chip_drv.c
        }
        while ((cmd[0] & 0x1U) == 0x1U);
      }
    }

    if (status != ARM_DRIVER_OK) {
      break;
    }
    /* Number of data items programmed */
    status = (int32_t)num;
		if (first_) {
			first_ = 0;
			addr = 0;
		}
  }
	
	
	if (SetWriteDisable()!= ARM_DRIVER_OK) {
	    return ARM_DRIVER_ERROR;
	}
	ReadStatusReg(CMD_READ_STATUS, &cmd[0]);  //CMD_READ_FLAG_STATUS
   
		/* Check Flags Status register value */
		if ((cmd[0] & 0x40U) != 0U) {
			return ARM_DRIVER_ERROR;
		}

  return status;
}
 
int32_t spi_chip_write_1 (uint32_t addr, const void *data, uint32_t cnt) {  // one byte write
  const uint8_t *buf;
        uint8_t  cmd[4];
        int32_t  status;
        uint32_t num;

  if ((addr > (flschip->total_size*1024)) || (data == NULL)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }
	
	SPI_UsrLog ("\n addr -> 0x%05x   cnt -> 0x%03x", addr, cnt);

  status = ARM_DRIVER_OK;

  num = 0U;
  buf = data;

  while (cnt) {
    /* Enable data write */
    if (flschip->feature_bits	& (FEATURE_WRSR_WREN | FEATURE_WREN)) status = SetWriteEnable();
		   else status = ARM_DRIVER_OK;
    
    if (status == ARM_DRIVER_OK) {
      /* Select Slave */
      status = ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_ACTIVE);
      
      if (status == ARM_DRIVER_OK) {
        /* Prepare command with address */
        cmd[0] = CMD_PROGRAM_BYTE;
        cmd[1] = (uint8_t)(addr >> 16U);
        cmd[2] = (uint8_t)(addr >>  8U);
        cmd[3] = (uint8_t)(addr >>  0U);

        status = ptrSPI->Send(cmd, 4U);

        if (status == ARM_DRIVER_OK) {
          /* Wait until command and address are sent */
          while (ptrSPI->GetDataCount() != 4U) {__asm("nop");};

          status = ptrSPI->Send(&buf[num], 1);

          if (status == ARM_DRIVER_OK) {
            /* Wait until data sent */
            while (ptrSPI->GetDataCount() != 1) {__asm("nop");};

            addr ++;
            num  ++;
            cnt  --;
          }
        }
      }
      /* Deselect Slave */
      ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_INACTIVE);

      if (status == ARM_DRIVER_OK) {
        /* Read status until device ready */
        do {
          status = ReadStatusReg(CMD_READ_STATUS, &cmd[0]);  //CMD_READ_FLAG_STATUS
          if (status != ARM_DRIVER_OK) {
            break;
          }

          /* Check Flags Status register value */
          if ((cmd[0] & 0x1U) != 1U) {
            FlashStatus.busy = 0U;
          }

        }
        while ((cmd[0] & 0x1U) == 0x1U);
      }
    }

    if (status != ARM_DRIVER_OK) {
      break;
    }
    /* Number of data items programmed */
    status = (int32_t)num;
  }

  return status;
}

/**
  \fn          int32_t ARM_Flash_EraseSector (uint32_t addr)
  \brief       Erase Flash Sector.
  \param[in]   addr  Sector address
  \return      \ref execution_status
*/
static int32_t EraseSector (uint32_t addr) {
  uint8_t buf[4];
  int32_t status;
	uint8_t i;
	
	for (i = 0; i < NUM_ERASEFUNCTIONS; i++) {
		 if (flschip->block_erasers[i].eraseblocks->size == 4 * 1024) break;
	 }
	if (i == NUM_ERASEFUNCTIONS) return ARM_DRIVER_ERROR_PARAMETER;  //not find

  if (flschip->feature_bits & FEATURE_WRSR_WREN) status = SetWriteEnable();
	   else status = ARM_DRIVER_OK;

  if (status == ARM_DRIVER_OK) {
    FlashStatus.busy  = 1U;
    FlashStatus.error = 0U;

		buf[0] = flschip->block_erasers[i].block_erase ;//CMD_SECTOR_ERASE;
    buf[1] = (uint8_t)(addr >> 16U);
    buf[2] = (uint8_t)(addr >>  8U);
    buf[3] = (uint8_t)(addr >>  0U);
		
    status = SendCmd(buf, 4U);
  }

  return status;
}
//static int32_t memcmp_(uint32_t * buf, uint32_t val,  uint32_t word_cnt){
//	
//  int32_t status = 0;
//	uint32_t addr;
//	
//	while (word_cnt){
//		if (*buf != val) return 1;
//		buf++;
//		word_cnt =-4;
//	}
//	return 0;
//}

static int32_t isErased (void) {
  uint32_t buf[0x40], buf_[0x40];
  int32_t status = 0;
	uint32_t addr;
	
	memset(buf_, 0xff, sizeof(buf_));
	for (addr=0; addr<flschip->total_size*1024;) {
		//if ((addr & 0x3fff)  == 0) BSP_LED_Toggle(LED3);
		ReadData(addr, (uint32_t *)&buf[0], sizeof(buf));
		status += memcmp(buf, buf_, sizeof(buf));
		//status += memcmp_(buf, 0xffffffff, sizeof(buf));
		if (status) break;
		addr += sizeof(buf)*4;
	}
	return status;
}

//static int32_t isLocked(void) {
//  uint8_t cmd[4];
//  int32_t status;
//	 
//	status = ReadStatusReg(CMD_READ_STATUS, &cmd[0]);  //
//          if (status == ARM_DRIVER_OK) {
//						if (cmd[0] & 0x0CU) {
//							 printf("\n Flash is locked for writing!!!");	
//							 return 1;
//						}	
//            else return ARM_DRIVER_OK;						
//					}
//					else return ARM_DRIVER_ERROR; 

//}

//int32_t spi_disable_blockprotect (void) {
//	uint8_t cmd[4], stat;
//  int32_t status;
//	 
//	if (isLocked() == 1){
//		if (WriteStatusReg(0)) return ARM_DRIVER_ERROR;
//		status = ReadStatusReg(CMD_READ_STATUS, &cmd[0]);  //CMD_READ_FLAG_STATUS
//          if (status != ARM_DRIVER_OK) {
//            return ARM_DRIVER_ERROR;
//          }
//          /* Check Flags Status register value */
//          if (cmd[0] & 0x0CU) {
//            return 1;
//          }
//					 else return ARM_DRIVER_OK;
//		
//	} 
//    else  if (isLocked() == ARM_DRIVER_OK) return ARM_DRIVER_OK;
//	      else return ARM_DRIVER_ERROR;
//}





/**
  \fn          int32_t ARM_Flash_EraseChip (void)
  \brief       Erase complete Flash.
               Optional function for faster full chip erase.
  \return      \ref execution_status
*/
 int32_t EraseChip (void) {
	 uint8_t i;
	 
	 if (!(flschip->erase)) {
		 SPI_UsrLog("\n No erase support!");
		 return ARM_DRIVER_ERROR_UNSUPPORTED;
	 }
	 for (i = 0; i < NUM_ERASEFUNCTIONS; i++) {
		 //search for a command to erase the entire chip,  not individual sectors
		 if (flschip->block_erasers[i].eraseblocks->count == 1 && flschip->block_erasers[i].eraseblocks[1].size == 0) break;
	 }
	 
	 return flschip->erase(flschip->block_erasers[i].block_erase);
 }
 
int32_t spi_erase_bulk (uint8_t cmd) {
  //uint8_t cmd[4];
  int32_t status;
	uint8_t buf[4];
	volatile int32_t led_tgl=30;
	
	 
	if (isErased() == 0) return ARM_DRIVER_OK; //no need execute erase
	 
